Repository: microsoft/terminal
Catalog: src/cascadia/TerminalConnection/Resources/*/Resources.resw
Source language: en_us
Languages: de_de, it_it, ko_kr, ru_ru, zh_cn

# AzureCodeExpiry
source: This code will expire in 15 minutes.
de_de: Dieser Code läuft in 15 Minuten ab.
it_it: Il codice scadrà tra 15 minuti.
ko_kr: 해당 코드는 15분 후에 만료됩니다.
ru_ru: Срок действия этого кода истекает через 15 минут.
zh_cn: 此代码将在 15 分钟后过期。

# AzureEnterTenant
source: Please enter the desired tenant number.
de_de: Geben Sie die gewünschte Mandantennummer ein.
it_it: Immetti il numero del tenant desiderato.
ko_kr: 필요한 테넌트 번호를 입력하세요.
ru_ru: Введите нужное число клиентов.
zh_cn: 请输入所需的租户编号。

# AzureNewLogin
source: Enter {0} to login with a new account
de_de: Drücken Sie {0}, um sich mit einem neuen Konto anzumelden.
it_it: Immetti {0} per accedere con un nuovo account
ko_kr: {0}을(를) 입력하여 새 계정으로 로그인합니다.
ru_ru: Введите {0}, чтобы войти с другой учетной записью
zh_cn: 输入 {0} 以使用新帐户进行登录

# AzureRemoveStored
source: Enter {0} to remove the above saved connection settings.
de_de: Geben Sie {0} ein, um die oben gespeicherten Verbindungseinstellungen zu entfernen.
it_it: Immetti {0} per rimuovere le impostazioni di connessione salvate sopra.
ko_kr: {0}을(를) 입력하여 위에 저장한 연결 설정을 제거합니다.
ru_ru: Введите {0}, чтобы удалить указанные выше сохраненные параметры подключения.
zh_cn: 输入 {0} 以删除上面保存的连接设置。

# AzureInvalidAccessInput
source: Please enter a valid number to access the stored connection settings, {0} to log in with a new account, or {1} to remove the saved connection settings.
de_de: Geben Sie eine gültige Zahl ein, um auf die gespeicherten Verbindungseinstellungen zuzugreifen, {0}, um sich mit einem neuen Konto anzumelden oder {1}, um die gespeicherten Verbindungseinstellungen zu entfernen.
it_it: Immetti un numero valido per accedere alle impostazioni di connessione memorizzate, {0} per accedere con un nuovo account o {1} per rimuovere le impostazioni di connessione salvate.
ko_kr: 저장한 연결 설정에 액세스하려면 올바른 숫자를 입력하고 {0}하여 새 계정으로 로그인하거나 {1}하여 저장한 연결 설정을 제거합니다.
ru_ru: Введите действительный номер, чтобы получить доступ к сохраненным параметрам подключения, {0}, чтобы войти с новой учетной записью, или {1}, чтобы удалить сохраненные параметры подключения.
zh_cn: 请输入有效的数字以访问存储的连接设置，输入 {0} 以使用新帐户进行登录，或者输入 {1} 以删除保存的连接设置。

# AzureNonNumberError
source: Please enter a number.
de_de: Geben Sie bitte eine Zahl ein.
it_it: Immetti un numero.
ko_kr: 숫자를 입력하세요.
ru_ru: Введите число.
zh_cn: 请输入一个数字。

# AzureNumOutOfBoundsError
source: Number out of bounds. Please enter a valid number.
de_de: Zahl außerhalb des gültigen Bereichs. Geben Sie eine gültige Anzahl ein.
it_it: Numero fuori intervallo. Immetti un numero valido.
ko_kr: 숫자의 범위가 초과되었습니다. 올바른 숫자를 입력하세요.
ru_ru: Число вне допустимого диапазона. Введите допустимое число.
zh_cn: 数字超出范围。请输入一个有效的数字。

# AzureNoTenants
source: Could not find any tenants.
de_de: Es wurden keine Mandanten gefunden.
it_it: Nessun tenant trovato.
ko_kr: 테넌트를 찾을 수 없습니다.
ru_ru: Не удалось найти клиенты.
zh_cn: 无法找到任何租户。

# AzureNoCloudAccount
source: You have not set up your cloud shell account yet. Please go to https://shell.azure.com to set it up.
de_de: Sie haben noch kein Cloud Shell-Konto eingerichtet. Wechseln Sie zu https://shell.azure.com, um es einzurichten.
it_it: Non hai ancora configurato il tuo account Cloud Shell. Passa a https://shell.azure.com per configurarlo.
ko_kr: 아직 클라우드 셸 계정을 설정하지 않았습니다. https://shell.azure.com으로 이동하여 계정을 설정하세요.
ru_ru: Вы еще не настроили свою учетную запись в облачной оболочке. Чтобы сделать это, перейдите на страницу https://shell.azure.com.
zh_cn: 尚未设置云 shell 帐户。请访问 https://shell.azure.com 进行设置。

# AzureStorePrompt
source: Do you want to save these connection settings for future logins? [{0}/{1}]
de_de: Möchten Sie diese Verbindungseinstellungen für zukünftige Anmeldungen speichern? [{0}/{1}]
it_it: Vuoi salvare queste impostazioni di connessione per gli accessi futuri? [{0}/{1}]
ko_kr: 이후 로그인에 대한 연결 설정을 저장하시겠습니까? [{0}/{1}]
ru_ru: Сохранить эти параметры подключения для будущих попыток входа? [{0}/{1}]
zh_cn: 是否要保存这些连接设置以供将来登录? [{0}/{1}]

# AzureInvalidStoreInput
source: Please enter {0} or {1}
de_de: Geben Sie {0} oder {1} ein.
it_it: Immetti {0} o {1}
ko_kr: {0} 또는 {1}을(를) 입력하십시오.
ru_ru: Введите {0} или {1}
zh_cn: 请输入 {0} 或 {1}

# AzureRequestingCloud
source: Requesting a cloud shell instance...
de_de: Anfordern einer Cloud-Shell-Instanz...
it_it: Richiesta istanza di Cloud Shell in corso...
ko_kr: 클라우드 셸 인스턴스를 요청 중...
ru_ru: Запрос экземпляра облачной оболочки…
zh_cn: 正在请求云 shell 实例...

# AzureSuccess
source: Succeeded.
de_de: Erfolgreich.
it_it: Operazione completata.
ko_kr: 성공했습니다.
ru_ru: Успешно.
zh_cn: 已成功。

# AzureRequestingTerminal
source: Requesting a terminal (this might take a while)...
de_de: Ein Terminal wird angefordert (Dies kann eine Weile dauern)...
it_it: Richiesta terminale in corso (l'operazione potrebbe richiedere alcuni minuti)...
ko_kr: 터미널 요청 중(시간이 걸릴 수 있음)...
ru_ru: Запрос терминала (это может занять некоторое время)…
zh_cn: 正在请求终端(这可能需要一些时间)...

# AzureTokensStored
source: Your connection settings have been saved for future logins.
de_de: Ihre Verbindungseinstellungen wurden für zukünftige Anmeldungen gespeichert.
it_it: Le impostazioni di connessione sono state salvate per gli accessi futuri.
ko_kr: 이후 로그인에 대한 사용자의 연결 설정이 저장되었습니다.
ru_ru: Параметры подключения сохранены для будущих попыток входа.
zh_cn: 已保存你的连接设置以供将来登录。

# AzureNoTokens
source: No tokens to remove.
de_de: Keine zu entfernenden Token.
it_it: Nessun token da rimuovere.
ko_kr: 제거할 토큰이 없습니다.
ru_ru: Нет маркеров, которые следует удалить.
zh_cn: 没有要删除的令牌。

# AzureTokensRemoved
source: Saved connection settings removed.
de_de: Die gespeicherten Verbindungseinstellungen wurden entfernt.
it_it: Le impostazioni di connessione salvate sono state rimosse.
ko_kr: 연결 설정 제거됨 저장
ru_ru: Сохраненные параметры подключения удалены.
zh_cn: 已删除保存的连接设置。

# AzureOldCredentialsFlushedMessage
source: Authentication parameters changed. You'll need to log in again.
de_de: Authentifizierungs Parameter geändert. Sie müssen sich erneut anmelden.
it_it: Parametri di autenticazione modificati. Dovrai eseguire di nuovo l'accesso.
ko_kr: 인증 매개 변수가 변경 되었습니다. 다시 로그인 해야 합니다.
ru_ru: Параметры проверки подлинности изменены. Необходимо снова войти в систему.
zh_cn: 身份验证参数已更改。您需要重新登录。

# AzureUnknownTenantName
source: <unknown tenant name>
de_de: <unbekannter Mandantenname>
it_it: <nome tenant sconosciuto>
ko_kr: <알 수 없는 테넌트 이름>
ru_ru: <неизвестное имя клиента>
zh_cn: <未知租户名称>

# AzureIthTenant
source: Tenant {0}: {1} ({2})
de_de: Mandant {0}: {1} ({2})
ko_kr: 테넌트 {0}: {1} ({2})
ru_ru: Клиент {0}: {1} ({2})
zh_cn: 租户 {0}: {1} ({2})

# AzureSuccessfullyAuthenticated
source: Authenticated.
de_de: Authentifiziert.
it_it: Autenticato.
ko_kr: 확인되었습니다.
ru_ru: Проверка подлинности выполнена.
zh_cn: 已经过身份验证。

# AzureUserEntry_Yes
source: y
de_de: J
it_it: s

# ProcessExited
source: [process exited with code {0}]
de_de: [Verarbeitung des Prozesses mit Code {0} beendet]
it_it: [processo terminato con codice {0}]
ko_kr: [코드 {0}로 프로세스 종료됨]
ru_ru: [процесс завершил работу с кодом {0}]
zh_cn: [已退出进程，代码为 {0}]

# ProcessFailedToLaunch
source: [error {0:#08x} when launching `{1}']
de_de: [Fehler {0} beim Start von `{1}']
it_it: [errore {0} durante l'avvio di `{1}']
ko_kr: [’{1}' 시작 시 {0} 오류 발생]
ru_ru: [ошибка {0} при запуске "{1}"]
zh_cn: [出现错误 {0} (启动“{1}”时)]

# BadPathText
source: Could not access starting directory "{0}"
de_de: Auf das Startverzeichnis „{0}“ konnte nicht zugegriffen werden
it_it: Non è possibile accedere alla directory di avvio "{0}"
ko_kr: 시작 디렉터리 "{0}"에 액세스할 수 없습니다.
ru_ru: Не удалось получить доступ к запуску каталога "{0}"
zh_cn: 无法访问启动目录“{0}”
